nce3-1/L19.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-22 Wed 15:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="lenovo" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org80dce40" class="outline-2">
<h2 id="org80dce40">Lesson 19 A very dear cat</h2>
<div class="outline-text-2" id="text-org80dce40">
<p class="verse">
Why was Rastus 'very dear' in more ways than one?<br />
<br />
Kidnappers are rarely interested in animals,<br />
&#xa0;but they recently took considerable interest in Mrs. Eleanor Ramsay's cat.<br />
Mrs. Eleanor Ramsay, a very wealthy old lady,<br />
&#xa0;has shared a flat with her cat, Rastus, for a great many years.<br />
Rastus leads an orderly life.<br />
He usually takes a short walk in the evenings and is always home by seven o'clock.<br />
One evening, however, he failed to arrive.<br />
Mrs. Ramsay got very worried.<br />
She looked everywhere for him but could not find him.<br />
<br />
Three days after Rastus' disappearance, Mrs. Ramsay received an anonymous letter.<br />
The writer stated that Rastus was in safe hands and would be returned immediately<br />
&#xa0;if Mrs. Ramsay paid a ransom of 1,000 dollars.<br />
Mrs. Ramsay was instructed to place the money in a cardboard box and to leave it outside her door.<br />
At first, she decided to go to the police,<br />
&#xa0;but fearing that she would never see Rastus again<br />
&#xa0;&#x2013; the letter had made that quite clear &#x2013;<br />
&#xa0;she changed her mind.<br />
She withdrew 1,000 dollars from her bank and followed the kidnapper's instructions.<br />
The next morning, the box had disappeared<br />
&#xa0;but Mrs. Ramsay was sure that the kidnapper would keep his word.<br />
Sure enough, Rastus arrived punctually at seven o'clock that evening.<br />
He looked very well, though he was rather thirsty, for he drank half a bottle of milk.<br />
The police were astounded when Mrs. Ramsay told them what she had done.<br />
She explained that Rastus was very dear to her.<br />
Considering the amount she paid, he was dear in more ways than one!<br />
</p>
</div>

<div id="outline-container-orgb35c501" class="outline-3">
<h3 id="orgb35c501">words</h3>
<div class="outline-text-3" id="text-orgb35c501">
<p>
dear [dɪr] adj. 亲爱的；珍贵的；昂贵的<br />
kidnapper ['kɪdnæpə(r)] n. 绑架者，拐骗者<br />
considerable [kənˈsɪd(ə)rəb(ə)l] adj. 相当大的<br />
wealthy [ˈwelθi] adj. 富的，有钱的<br />
orderly [ˈɔrdərli] adj. 有规律的<br />
disappearance [ˌdɪsəˈpɪrəns] n. 失踪<br />
anonymous [əˈnɑnɪməs] adj. 匿名的<br />
ransom [ˈrænsəm] n. 赎金<br />
cardboard [ˈkɑrdˌbɔrd] n. 硬纸板<br />
withdraw [wɪðˈdrɔ] (withdrew [wið'dru:],withdrawn [wið'drɔ:n]) v.(从银行)取钱<br />
punctually ['pʌŋktʃuəli] adv. 准时地<br />
astound [əˈstaʊnd] v. 使吃惊<br />
</p>
</div>
</div>

<div id="outline-container-org4a43422" class="outline-3">
<h3 id="org4a43422">单词造句</h3>
</div>
<div id="outline-container-org4222530" class="outline-3">
<h3 id="org4222530">反复听电影片段直到懂关键句</h3>
</div>
<div id="outline-container-org4ca9c25" class="outline-3">
<h3 id="org4ca9c25">复习二册语法(笔记或视频) &amp; 红皮书</h3>
</div>
<div id="outline-container-org5b81dea" class="outline-3">
<h3 id="org5b81dea">习惯用法造句</h3>
</div>
<div id="outline-container-orgc681f44" class="outline-3">
<h3 id="orgc681f44">跟读 50遍</h3>
</div>
<div id="outline-container-orge8a8b24" class="outline-3">
<h3 id="orge8a8b24">Comprehension 反复练习</h3>
</div>
<div id="outline-container-orgf0f7ab1" class="outline-3">
<h3 id="orgf0f7ab1">Ask me if 写+读</h3>
</div>
<div id="outline-container-org7a24a66" class="outline-3">
<h3 id="org7a24a66">摘要写作 写 &amp; 对答案</h3>
</div>
<div id="outline-container-orgd7b0133" class="outline-3">
<h3 id="orgd7b0133">tell the story 口语复述</h3>
</div>
<div id="outline-container-org44a1756" class="outline-3">
<h3 id="org44a1756">composition 阅读 或 写作</h3>
</div>
<div id="outline-container-orga74c430" class="outline-3">
<h3 id="orga74c430">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
